Repository: eddyem/eddys_snippets
Catalog: HSFW_management/locale/*/*.po
Languages: ru

source: All records from EEPROM
ru: Все записи EEPROM

source: Connected wheel properties
ru: Свойства подключенного колеса

source: %s: argument needed!
ru: %s: необходим аргумент!

source: Already at position
ru: Уже в заданной позиции

source: Can't close mmap'ed file
ru: Не могу закрыть mmap'нутый файл

source: Can't get settings
ru: Не могу получить настройки

source: Can't munmap
ru: Не могу munmap

source: Can't open %s
ru: Не могу открыть %s

source: Can't open %s for reading
ru: Не могу открыть %s для чтения

source: Can't open device
ru: Не могу открыть устройство

source: Can't rename
ru: Не удалось переименовать

source: Can't set settings
ru: Не могу установить настройки

source: Can't setup console
ru: Не могу настроить консоль

source: Can't stat %s
ru: Не могу выполнить stat %s

source: Cycling detected, try again
ru: Зацикливание, попробуйте еще раз

source: Error ocured, repeat again
ru: Произошла ошибка, повторите запуск

source: Error reading data
ru: Ошибка чтения данных

source: Error sending data
ru: Ошибка отправки данных

source: Error, tries amount exceed
ru: Ошибка, количество попыток истекло

source: Filter %s not found!
ru: Фильтр %s не обнаружен

source: Filter ID should have two symbols: wheel ID and filter position
ru: Идентификатор фильтра должен состоять из двух символов: идентификатора колеса и номера позиции

source: Filter position should be a number from 1 to %d!
ru: Позиция фильтра должна быть числом от 1 до %d!

source: Found %d turrets but have no access rights to any
ru: Обнаружено %d турелей, но ни к одной нет прав доступа

source: Given position out of range 1..%d
ru: Заданная позиция вне диапазона 1..%d

source: Given wheel not found!
ru: Заданное колесо не обнаружено!

source: Ignore parameters:
ru: Игнорируются параметры:

source: Integer out of range
ru: Целое вне допустимого диапазона

source: Mmap error for input
ru: Ошибка mmap

source: More than one turret with serial '%s' found!
ru: Обнаружено более одной турели с серийным номером '%s'!

source: More than one wheel with ID '%c' found!
ru: Обнаружено более одного колеса с идентификатором '%c'!

source: More than one wheel with filter name '%s' found!
ru: Обнаружено больше одного колеса с именем фильтра '%s'!

source: More than one wheel with name '%s' found!
ru: Обнаружено более одного колеса с именем '%s'!

source: Name should be not longer than 8 symbols
ru: Название не должно превышать восьми символов

source: No filename given!
ru: Не задано имя файла!

source: No turrets found
ru: Турели не обнаружены

source: Succesfully renamed!
ru: Переименовано удачно!

source: Turret isn't initialized, move home...
ru: Турель не инициализирована, движение в "дом"

source: Turret with serial '%s' not found
ru: Турель с серийным номером '%s' не найдена

source: Wait for end of moving
ru: Ожидание окончания движения

source: Wheel ID should be a letter from "A" to "H"!
ru: Идентификатор колеса должен быть буквой от "A" до "H"!

source: Wheel with ID '%c' not found
ru: Колесо с идентификатором '%c' не найдено

source: Wheel with name '%s' not found
ru: Колесо с именем '%s' не найдено

source: Wrong argument "%s" of parameter "%s"
ru: Неправильный аргумент "%s" параметра "%s"

source: Wrong double number format!
ru: Неправильный формат числа double!

source: Wrong helpstring!
ru: Неправильный формат строки помощи

source: Wrong parameter: %s
ru: Неправильный параметр: %s

source: You should give new filter/wheel name and its POS/ID to rename!
ru: Чтобы переименовать, необходимо указать новое название фильтра/колеса и его позицию/идентификатор!

source: filter identificator like "A3"
ru: идентификатор фильтра, например, "A3"

source: filter name
ru: название фильтра

source: filter position number
ru: номер позиции фильтра

source: letter wheel identificator
ru: буквенный идентификатор колеса

source: list all stored names
ru: список всех сохраненных имен

source: list only present devices' names
ru: список имен только присутствующих устройств

source: move to home position
ru: переместиться в стартовую позицию

source: rename stored wheels/filters names
ru: переименовать сохраненные имена колес/фильтров

source: reset all names to default values
ru: сбросить все названия в значения по умолчанию

source: show this help
ru: отобразить эту справку

source: turret serial (with leading zeros)
ru: серийный номер турели (с начальными нулями)

source: wheel name
ru: название колеса
